import React, { useState } from 'react';
import AccordionItem from './Accordion/AccordionItem';

const Faq = () => {
  const [activeIndex, setActiveIndex] = useState(1);
    const faqData = [
        {
          question: "কিভাবে ক্লাস নেয়া হবে ?",
          answer: "আমাদের লাইভ ওয়ান টু ওয়ান ক্লাসগুলো MIcrosoft Teams অ্যাপ এর মাদ্ধমে নেয়া হয় এবং আপনাদের ক্লাস জয়েন করার Experience সহজতর করতে আমাদের রয়েছে সকল ডিভাইসে ক্লাস জয়েন করার ভিডিও টিউটোরিয়াল এছাড়াও আমাদের রয়েছে অভিজ্ঞ আইটি এক্সপার্ট যিনি আপনাদের ক্লাস জয়েন সম্পর্কিত যেকোন সমস্যার সমাধান করতে সবসময় প্রস্তুত থাকবেন"
        },
        {
          question: "কিভাবে ফ্রি ট্রায়াল ক্লাস গ্রহণ করব ?",
          answer: "আমাদের ওয়েব সাইটে প্রথমেই ট্রায়াল ক্লাস এর যেই ফর্ম দেয়া আছে সেইটি পূরণ করে আপনি আমাদের ফ্রি ট্রায়াল ক্লাসে অংশগ্রহণ করতে পারবেন । ফর্মটি পূরণ করে সাবমিট করলে আমাদের ১জন দীনি ভাই আপনার সাথে যোগাযোগ করবে এবং তখন বাকিসব তথ্য দিয়ে আপনাকে ক্লাসে অংশগ্রহণ করতে সাহায্য করবেন । এছাড়াও আপনি সরাসরি আমাদের ওয়েবসাইটে নিচের দিকে ডানকোনাই দেয়া Whatsapp বাটনে ক্লিক করে সরাসরি আমাদের সাথে কথা বলেও আপনার কুরআন শেখার যাত্রা শুরু করতে পারেন"
        },
        {
          question: "কেন ১টি ফ্রি ট্রায়াল ক্লাস ?",
          answer: "শেখার সুবিধার্থে আমরা আপনাদের জন্য ১টি ফ্রি ট্রায়াল ক্লাস এর ব্যবস্থা রেখেছি যেখানে আপনি এবং আমাদের সম্মানিত উস্তাদ পরিচিত হতে পারবেন এবং আপনার কুরআন শেখার প্রথম যাত্রা শুরু হবে ইনশাল্লাহ । ট্রায়াল ক্লাসে আপনার যদি আমাদের কুরআনের শিক্ষক পছন্দ না হয় তাহলে আপনারা অবশ্যই আমাদের জানাবেন , আমরা ইনশাআল্লাহ তখন আপনার জন্য আরও ভাল শিক্ষক নিযুক্ত করব"
        },
        {
          question: "আপনাদের হাদিয়া কত ?",
          answer: "আমাদের উদ্দেশ্যই হচ্ছে আপনাদের মত প্রবাসিদের মধ্যে কুরআন এর আলো পৌঁছিয়ে দেয়া ,কিন্তু এর জন্য আমাদের কিছু খরচ আছে যেইগুলো আমাদের নিজেদের পক্ষে বহন করা সম্ভব নই । আমাদের শিক্ষকদের হাদিয়া দিতে হই, যেহেতু অনলাইন ক্লাস তাই যেকোনো ধরনের technical সমস্যার জন্য technical expert রয়েছে , আপনাদের সার্বক্ষণিক সহায়তার জন্য রয়েছে আরও কিছু টিম মেম্বার । তার পরও আমরা যথেষ্ট কম খরচে আপনাদের কুরআন শেখার ব্যবস্থা করে থাকি । আমাদের হাদিয়ার পরিমাণটা নির্ধারিত হয় ক্লাস টাইম এর ওপর ভিত্তি করে ,তাই এই সম্পর্কে বিস্তারিত জানতে আমাদের whatsapp এ মেসেজ দিন"
        },
        {
          question: "ট্রায়াল ক্লাস এর পর কি করতে হবে?",
          answer: "আপনার ট্রায়াল ক্লাস সম্পন্ন হলে আমরা আপনার সাথে পুনরাই যোগাযোগ করব ইনশাল্লাহ এবং তারপর আপনি কতসময় ধরে ক্লাস নিতে চান ,সপ্তাহে কইদিন ক্লাস নিতে চান এবং কি শিখতে চান এইগুলো জানার পর আমরা আপনাকে আমাদের হাদিয়া কত দিতে হবে এই সম্পর্কে অবহিত করব । তারপর আল্লাহর ইচ্ছাই সব ঠিক থাকলে আপনি আপনার কুরআন শেখার যাত্রা শুরু করবেন ইনশাল্লাহ"
        },
        {
          question: "আপনাদের কিভাবে পেমেন্ট করব ?",
          answer: "আলহামদুলিল্লাহ আপনি আমাদের ব্যাংক অ্যাকাউন্টে অথবা বিকাশ /নগদ এর মাধ্যমেও পেমেন্ট করতে পারবেন"
        }
      ];

      const renderedQuestionsAnswers = faqData.map((item, index) => {
        const showDescription = index === activeIndex ? "show-description" : "";
        const fontWeightBold = index === activeIndex ? "font-weight-bold" : "";
        const ariaExpanded = index === activeIndex ? "true" : "false";
        return (
          <AccordionItem
            showDescription={showDescription}
            fontWeightBold={fontWeightBold}
            ariaExpanded={ariaExpanded}
            item={item}
            index={index}
            onClick={() => {
              setActiveIndex(index);
            }}
          />
        );
      });

  return (
    <div className="faq">
    <h1 className="faq-title text-center mt-5 mb-4">সচরাচর জিজ্ঞাসা</h1>
    <dl className="faq-list">{renderedQuestionsAnswers}</dl>
  </div>
  );
};

export default Faq;