import React from "react";

import "./main.css";
import { Envelope, Phone } from "@phosphor-icons/react";

const Main = () => {
  return (
    <>
    <div className="top-bar">
      <div className="top-info"><Envelope size={20} /> <span className="ps-1">tolabulquran@gmail.com</span></div>
      <div className="top-info"><Phone size={20} /> <span className="ps-1">+8801625002500</span></div>
    </div>
      <div className="hero-section">
        <div className="hero-wrapper">
          <div className="hero-img-wrapper">
            <img src="/image1.png" alt="image1" />
          </div>
          <div className="hero-details">
            <h1>সহিহ কুরআন শিখুন ঘরে বসেই..</h1>
            <p>কুরআন শিক্ষা প্রত্যেক মুসলিমের জন্য ফরজ । তাই আর অনীহা না করে আজ থেকেই কুরআন দিয়ে জীবন গড়া শুরু করুন।</p>
            <button className="button">যোগাযোগ করুন</button>
          </div>
        </div>
      </div>
      <div className="commit-section">
        <div className="commit-wrapper">
          <div className="commit-details">
            <h1>আল- কুরআন শিখুন যে কোন সময়, বিশ্বের যেকোন স্থান থেকে!</h1>
            <h4 className="commit-tag">বিশ্বস্থতায় আমরা প্রতিশ্রুতিবদ্ধ।</h4>
            <p>আলহামদুলিল্লাহ উম্মুল কুরআন বিশ্বব্যাপি বাংলাদেশি ভাই-বোনদের তাদের সুবিধামত সময়ে ,সপ্তাহের যেকোন দিন ,অভিজ্ঞ শিক্ষক / শিক্ষিকা দ্বারা লাইভ সহিহ কোরআন শিক্ষা / হিফযুল কোরআন / আরবি ভাষা শিক্ষা সেবা প্রদান করে আসছে। আমাদের বিশেষায়িত শিক্ষক আছেন যারা ভার্চুয়াল ক্লাস নেওয়ায় বিশেষ প্রশিক্ষিত। উম্মুল কুরআন থেকে কুরআন শিখে আপনি বিশুদ্ধভাবে সকল নিয়ম অনুসরণ করে কুরআন পড়তে পারবেন ইনশাল্লাহ । আমাদের প্রতিষ্ঠানে শিশু, কিশোর ও প্রাপ্তবয়স্কদের জন্যে আলাদা আলাদা শিক্ষক রয়েছে, যাতে আপনার শেখাটা উপভোগ্য হয়। এখানে নারী-পুরুষদের জন্যে সম্পুর্ন পৃথক ব্যাবস্থাপনা। নারীদের জন্যে নারী শিক্ষিকা এবং পুরুষদের জন্যে পুরুষ শিক্ষক। আমাদের সকল শিক্ষক হাফেজ, ক্বারি, মাওলানা। সেই সাথে উচ্চতর ইসলামিক বিষয়ে অধ্যায়নরত, আমাদের অধিকাংশ শিক্ষক মিশরের আল- আজহার বিশ্ববিদ্যালয়ের ছাত্র / ছাত্রী,আর এই কারণে আমরা ২৪ঘন্টাই যেকোন সময় ক্লাস করাতে পারি আলহামদুলিল্লাহ্‌ আমাদের সমৃদ্ধ শিক্ষক প্যানেল থেকে আপনি বা আপনার সন্তানের জন্যে বেস্ট শিক্ষক সিলেক্ট করতে পারবেন। সেইসাথে পরবর্তীতে যেকোন সমস্যাই শিক্ষক পরিবর্তন করার বিকল্প অপশনও রয়েছে। আমরা স্বতঃস্ফূর্তভাবে শ্রেষ্ঠ শিক্ষক প্রদানে প্রতুশ্রুতিবদ্ধ। আমাদের শিক্ষক প্যানেলে বিভিন্ন ভাষায় দক্ষ শিক্ষক রয়েছে, যারা ইংরেজি,আরবি, বাংলা,হিন্দি, ভাষায় পাঠদানে সক্ষম।
            একজন মুসলিম হিসেবে আল কোরআন পড়তে জানা এবং আমল করা আমাদের ওপর ফরয ,আর আরবি ভাষা এমন এক ভাষা যেইখানে সামান্য টান ,গুন্নাহ ছুটে গেলেই অর্থ পরিবর্তন হয়ে যাই ,তাই লাইভ ক্লাসের মাধ্যমে অভিজ্ঞ হুজুরের কাছে সহিহ সুদ্ধভাবে কোরআন শেখার বিকল্প নেই । কুরআন আপনার জান্নাতে যাওয়ার পথকে সুগম করবে। আল্লাহ আপনার সহায় হোন।। জাযাকুমুল্লাহু খাইরান।</p>
            <button className="button commitBtn">আজই শুরু করুন</button>
          </div>
          <div className="commit-img-wrapper">
            <img src="/image2.png" alt="image1" />
          </div>
        </div>
      </div>
    </>
  );
};

export default Main;
